/******************** (C) COPYRIGHT 2011 野火嵌入式开发工作室 ********************
 * 文件名       ：isr.c
 * 描述         ：中断处理例程
**********************************************************************************/
#include "common.h"
#include "include.h"
#include  "isr.h"
#include "sensor.h"
#include"Speed_Control.h"

#include "OLED.h"
u8 TIME1flag_1s   = 0 ;
u8 TIME1flag_100ms = 0 ;
u8 flag_1ms=0; 
u8 TIME0flag_1ms=0;
uint8 TIME0flag_2ms;
uint8 TIME0flag_5ms;                    //PTI0 5ms标志位
uint8 TIME0flag_10ms;                    //PTI0 10ms标志位
uint8 TIME0flag_20ms;                    //PTI0 20ms标志位 
uint8 TIME0flag_80ms;                     //PTI0 80ms标志位   
uint8 TIME0flag_100ms;                     //PTI0 100ms标志位 
uint8 TIME0flag_200ms;                     //PTI0 100ms标志位 
uint8 TIME0flag_500ms;
uint16 TimeCount = 0;
//UART0中断调参变量
float  kprxdata,kirxdata,kdrxdata;
extern float TurnP,TurnD;
void PORTD_IRQHandler()    
{ 
  
}
void PORTC_IRQHandler() 
{
  
}
/*************************************************************************
*  函数名称：DMA_CH4_Handler
*  功能说明：DMA通道4的中断服务函数
*  参数说明：是采集摄像头数据，本数据位摄像头AD数据，可以采集到300个点。
             设置标志位能够及时搬移。
*************************************************************************/

void DMA_CH4_Handler(void)
{
  
}
/*************************************************************************
PIT0
*************************************************************************/



void PIT0_IRQHandler(void)//1ms中断
{
  PIT_Flag_Clear(PIT0);//清中断标志位 
  
  
 
   if(TimeCount%2 == 0 )
  {
    TIME0flag_2ms = 1;
  } 
  if(TimeCount%5 == 0 )
  {
    TIME0flag_5ms = 1;
  } 
  if(TimeCount%10 == 0 )
  {
    TIME0flag_10ms = 1;
  } 
  if(TimeCount%20 == 0 )
  {
    TIME0flag_20ms = 1;
    process();
  }
  if(TimeCount%80 == 0 )
  {
    TIME0flag_80ms = 1;
  }
  if(TimeCount%100 == 0 )
  {
    TIME0flag_100ms = 1;
  } 
   if(TimeCount%200 == 0 )
  {
    TIME0flag_200ms = 1;
  }
   if(TimeCount%500 == 0 )
  {
    TIME0flag_500ms = 1;
    TimeCount = 0 ;
  }
  //flag_1ms=1;          //1ms中断标志
 // run();          //
}
/*************************************************************************
*  函数名称：PIT1_IRQHandler
*  功能说明：PIT1定时中断服务函数
*************************************************************************/
void PIT1_IRQHandler(void)
{
  PIT_Flag_Clear(PIT1);       //清中断标志位
   /*static u8 Time1Count = 0 ;  
   
   TIME1flag_100ms =1 ;
   if(++Time1Count == 10)
   {
     TIME1flag_1s = 1 ;
     Time1Count = 0 ;
   }  */
}
/*************************************************************************
*  函数名称：USART0_IRQHandler
*  功能说明：串口0 中断 接收 服务函数
*************************************************************************/

void USART0_IRQHandler(void)
{ 
 
}
/*************************************************************************
*  函数名称：SysTick_Handler
*  功能说明：系统滴答定时器中断服务函数
*  修改时间：2012-2-18    已测试
*  备    注：ucos里用得到
*************************************************************************/
void SysTick_Handler(void)
{
    //    OSIntEnter();
    //    OSTimeTick();
    //    OSIntExit();
}
/*************************************************************************
*  函数名称：HardFault_Handler
*  功能说明：硬件上访中断服务函数
*  修改时间：2012-2-4    已测试
*  备    注：可以用LED闪烁来指示发生了硬件上访
*************************************************************************/
void HardFault_Handler(void)
{
    while (1)
    {
        printf("\n****硬件上访错误!!!*****\r\n\n");
    }
}

/*************************************************************************
*  函数名称：PendSV_Handler
*  功能说明：PendSV（可悬起系统调用）中断服务函数
*  修改时间：2012-2-15    已测试
*  备    注：uC/OS用来切换任务
*************************************************************************/
void PendSV_Handler(void)
{
}
/*************************************************************************
*  函数名称：PORTA_IRQHandler
*  功能说明：PORTA端口中断服务函数
*  修改时间：2012-1-25    已测试
*  备    注：引脚号需要自己初始化来清除
*************************************************************************/
void PORTA_IRQHandler()
{
}
/*************************************************************************
*  函数名称：FTM0_IRQHandler
*  功能说明：FTM0输入捕捉中断服务函数
*  修改时间：2012-2-25
*  备    注：引脚号需要根据自己初始化来修改，参考现有的代码添加自己的功能
*************************************************************************/
void FTM0_IRQHandler()
{
}
/*************************************************************************
*  函数名称：DMA_CH4_Handler
*  功能说明：DMA通道4的中断服务函数
*  参数说明：是采集摄像头数据，本数据位摄像头AD数据，可以采集到300个点。
             设置标志位能够及时搬移。
*************************************************************************/

void DMA_CH0_Handler(void)
{
                                    //使能通道CHn 硬件请求      (这样才能继续触发DMA传输)
}
/*************************************************************************
*  函数名称：LPT_Handler
*  功能说明：LPT通道4的中断服务函数
*************************************************************************/
volatile u32 LPT_INT_count=0;    
void  LPT_Handler(void)
{
    LPTMR0_CSR |= LPTMR_CSR_TCF_MASK;   //清除LPTMR比较标志
    LPT_INT_count++;                    //中断溢出加1
}

